005_write_heap/pgbench_write_2022-05-22T12:25:50.177358025.log
progress: 10.0 s, 38081.2 tps, lat 1.281 ms stddev 1.073
progress: 20.0 s, 38201.4 tps, lat 1.284 ms stddev 1.112
progress: 30.0 s, 38469.7 tps, lat 1.274 ms stddev 1.116
progress: 40.0 s, 33748.7 tps, lat 1.456 ms stddev 4.114
progress: 50.0 s, 37716.0 tps, lat 1.300 ms stddev 1.415
progress: 60.0 s, 37680.9 tps, lat 1.301 ms stddev 1.439
progress: 70.0 s, 34267.2 tps, lat 1.433 ms stddev 3.919
progress: 80.0 s, 37481.4 tps, lat 1.308 ms stddev 1.451
progress: 90.0 s, 38055.0 tps, lat 1.288 ms stddev 1.389
progress: 100.0 s, 34033.5 tps, lat 1.443 ms stddev 3.923
progress: 110.0 s, 37525.9 tps, lat 1.307 ms stddev 1.382
progress: 120.0 s, 37878.5 tps, lat 1.294 ms stddev 1.357
progress: 130.0 s, 34408.6 tps, lat 1.427 ms stddev 3.776
progress: 140.0 s, 37738.8 tps, lat 1.299 ms stddev 1.359
progress: 150.0 s, 37758.2 tps, lat 1.299 ms stddev 1.403
progress: 160.0 s, 34127.7 tps, lat 1.439 ms stddev 4.700
progress: 170.0 s, 37595.1 tps, lat 1.305 ms stddev 1.360
progress: 180.0 s, 37529.2 tps, lat 1.307 ms stddev 1.362
progress: 190.0 s, 33688.8 tps, lat 1.458 ms stddev 3.896
progress: 200.0 s, 37599.8 tps, lat 1.304 ms stddev 1.351
progress: 210.0 s, 37469.3 tps, lat 1.309 ms stddev 1.368
progress: 220.0 s, 34416.8 tps, lat 1.427 ms stddev 3.892
progress: 230.0 s, 35767.6 tps, lat 1.372 ms stddev 2.461
progress: 240.0 s, 37564.4 tps, lat 1.305 ms stddev 1.403
progress: 250.0 s, 29978.5 tps, lat 1.642 ms stddev 10.474
progress: 260.0 s, 34791.0 tps, lat 1.411 ms stddev 3.855
progress: 270.0 s, 36670.6 tps, lat 1.338 ms stddev 1.823
progress: 280.0 s, 34773.3 tps, lat 1.400 ms stddev 3.526
progress: 290.0 s, 33665.0 tps, lat 1.472 ms stddev 5.105
progress: 300.0 s, 35011.9 tps, lat 1.403 ms stddev 3.592
progress: 310.0 s, 36998.4 tps, lat 1.326 ms stddev 1.544
progress: 320.0 s, 31974.6 tps, lat 1.539 ms stddev 7.358
progress: 330.0 s, 30801.8 tps, lat 1.597 ms stddev 9.214
progress: 340.0 s, 35688.0 tps, lat 1.375 ms stddev 2.363
progress: 350.0 s, 31735.5 tps, lat 1.550 ms stddev 7.322
progress: 360.0 s, 32853.7 tps, lat 1.474 ms stddev 7.699
progress: 370.0 s, 33584.4 tps, lat 1.485 ms stddev 9.572
progress: 380.0 s, 28869.9 tps, lat 1.698 ms stddev 11.531
progress: 390.0 s, 33264.9 tps, lat 1.478 ms stddev 5.988
progress: 400.0 s, 33669.8 tps, lat 1.464 ms stddev 5.614
progress: 410.0 s, 28817.6 tps, lat 1.709 ms stddev 12.169
progress: 420.0 s, 33318.2 tps, lat 1.438 ms stddev 4.146
progress: 430.0 s, 31398.0 tps, lat 1.605 ms stddev 12.703
progress: 440.0 s, 35945.3 tps, lat 1.365 ms stddev 2.250
progress: 450.0 s, 28571.6 tps, lat 1.724 ms stddev 14.427
progress: 460.0 s, 33581.9 tps, lat 1.463 ms stddev 5.043
progress: 470.0 s, 35459.3 tps, lat 1.384 ms stddev 2.219
progress: 480.0 s, 25812.7 tps, lat 1.911 ms stddev 19.015
progress: 490.0 s, 34793.9 tps, lat 1.411 ms stddev 2.479
progress: 500.0 s, 16743.2 tps, lat 2.952 ms stddev 9.894
progress: 510.0 s, 25548.4 tps, lat 1.930 ms stddev 9.826
progress: 520.0 s, 32579.8 tps, lat 1.509 ms stddev 4.251
progress: 530.0 s, 32972.7 tps, lat 1.484 ms stddev 4.413
progress: 540.0 s, 29163.2 tps, lat 1.695 ms stddev 10.411
progress: 550.0 s, 34374.8 tps, lat 1.429 ms stddev 5.350
progress: 560.0 s, 33741.2 tps, lat 1.456 ms stddev 4.841
progress: 570.0 s, 32728.9 tps, lat 1.465 ms stddev 5.946
progress: 580.0 s, 32382.8 tps, lat 1.556 ms stddev 7.876
progress: 590.0 s, 32901.9 tps, lat 1.494 ms stddev 5.198
progress: 600.0 s, 36238.4 tps, lat 1.354 ms stddev 1.903
progress: 610.0 s, 33158.6 tps, lat 1.482 ms stddev 5.260
progress: 620.0 s, 34480.7 tps, lat 1.424 ms stddev 3.407
progress: 630.0 s, 36582.0 tps, lat 1.341 ms stddev 1.756
progress: 640.0 s, 31139.9 tps, lat 1.580 ms stddev 8.201
progress: 650.0 s, 36100.7 tps, lat 1.360 ms stddev 2.120
progress: 660.0 s, 34236.9 tps, lat 1.435 ms stddev 4.876
progress: 670.0 s, 31067.7 tps, lat 1.562 ms stddev 8.346
progress: 680.0 s, 33329.9 tps, lat 1.495 ms stddev 5.490
progress: 690.0 s, 35911.7 tps, lat 1.367 ms stddev 2.283
progress: 700.0 s, 29387.9 tps, lat 1.676 ms stddev 10.395
progress: 710.0 s, 31778.5 tps, lat 1.548 ms stddev 7.272
progress: 720.0 s, 35061.0 tps, lat 1.401 ms stddev 2.751
progress: 730.0 s, 27975.1 tps, lat 1.763 ms stddev 10.544
progress: 740.0 s, 33491.1 tps, lat 1.451 ms stddev 4.339
progress: 750.0 s, 37372.1 tps, lat 1.328 ms stddev 2.643
progress: 760.0 s, 35226.1 tps, lat 1.394 ms stddev 5.999
progress: 770.0 s, 20231.9 tps, lat 2.446 ms stddev 23.742
progress: 780.0 s, 35941.0 tps, lat 1.366 ms stddev 6.208
progress: 790.0 s, 37522.0 tps, lat 1.302 ms stddev 1.233
progress: 800.0 s, 22190.6 tps, lat 2.237 ms stddev 16.905
progress: 810.0 s, 33858.1 tps, lat 1.451 ms stddev 5.836
progress: 820.0 s, 37426.2 tps, lat 1.311 ms stddev 1.255
progress: 830.0 s, 34748.6 tps, lat 1.398 ms stddev 5.004
progress: 840.0 s, 26804.6 tps, lat 1.860 ms stddev 11.547
progress: 850.0 s, 36719.5 tps, lat 1.337 ms stddev 2.434
progress: 860.0 s, 36314.8 tps, lat 1.352 ms stddev 3.277
progress: 870.0 s, 25946.9 tps, lat 1.902 ms stddev 11.254
progress: 880.0 s, 35181.8 tps, lat 1.396 ms stddev 4.479
progress: 890.0 s, 34267.8 tps, lat 1.434 ms stddev 6.810
progress: 900.0 s, 27039.0 tps, lat 1.824 ms stddev 10.479
progress: 910.0 s, 34604.9 tps, lat 1.420 ms stddev 6.329
progress: 920.0 s, 36626.1 tps, lat 1.327 ms stddev 1.826
progress: 930.0 s, 2821.9 tps, lat 17.267 ms stddev 73.161
progress: 940.0 s, 308.7 tps, lat 163.877 ms stddev 176.571
progress: 950.0 s, 380.4 tps, lat 133.797 ms stddev 150.899
progress: 960.0 s, 6003.5 tps, lat 8.322 ms stddev 49.322
progress: 970.0 s, 39963.5 tps, lat 1.226 ms stddev 0.272
progress: 980.0 s, 39450.0 tps, lat 1.243 ms stddev 0.298
progress: 990.0 s, 39852.9 tps, lat 1.230 ms stddev 0.337
progress: 1000.0 s, 39745.2 tps, lat 1.233 ms stddev 0.283
progress: 1010.0 s, 20154.6 tps, lat 2.405 ms stddev 3.592
progress: 1020.0 s, 18336.8 tps, lat 2.739 ms stddev 14.957
progress: 1030.0 s, 33603.5 tps, lat 1.463 ms stddev 8.044
progress: 1040.0 s, 39213.0 tps, lat 1.251 ms stddev 0.291
progress: 1050.0 s, 39160.3 tps, lat 1.252 ms stddev 0.298
progress: 1060.0 s, 38806.5 tps, lat 1.264 ms stddev 0.333
progress: 1070.0 s, 38838.1 tps, lat 1.263 ms stddev 0.295
progress: 1080.0 s, 38916.3 tps, lat 1.260 ms stddev 0.347
progress: 1090.0 s, 38879.7 tps, lat 1.261 ms stddev 0.362
progress: 1100.0 s, 39687.8 tps, lat 1.235 ms stddev 0.284
progress: 1110.0 s, 39585.6 tps, lat 1.238 ms stddev 0.314
progress: 1120.0 s, 39329.9 tps, lat 1.247 ms stddev 0.320
progress: 1130.0 s, 39041.2 tps, lat 1.256 ms stddev 0.316
progress: 1140.0 s, 39152.2 tps, lat 1.252 ms stddev 0.344
progress: 1150.0 s, 39429.0 tps, lat 1.244 ms stddev 0.290
progress: 1160.0 s, 39097.6 tps, lat 1.254 ms stddev 0.324
progress: 1170.0 s, 39067.9 tps, lat 1.255 ms stddev 0.473
progress: 1180.0 s, 39094.6 tps, lat 1.254 ms stddev 0.386
progress: 1190.0 s, 39229.0 tps, lat 1.250 ms stddev 0.307
progress: 1200.0 s, 39412.4 tps, lat 1.244 ms stddev 0.415
progress: 1210.0 s, 39350.2 tps, lat 1.246 ms stddev 0.364
progress: 1220.0 s, 39438.8 tps, lat 1.243 ms stddev 0.331
progress: 1230.0 s, 39368.2 tps, lat 1.245 ms stddev 0.385
progress: 1240.0 s, 39606.0 tps, lat 1.238 ms stddev 0.299
progress: 1250.0 s, 39420.0 tps, lat 1.244 ms stddev 0.316
progress: 1260.0 s, 39450.0 tps, lat 1.243 ms stddev 0.412
progress: 1270.0 s, 39601.0 tps, lat 1.238 ms stddev 0.310
progress: 1280.0 s, 39033.6 tps, lat 1.256 ms stddev 0.341
progress: 1290.0 s, 38972.7 tps, lat 1.258 ms stddev 0.514
progress: 1300.0 s, 37095.2 tps, lat 1.323 ms stddev 1.860
progress: 1310.0 s, 38964.6 tps, lat 1.259 ms stddev 0.338
progress: 1320.0 s, 39217.1 tps, lat 1.251 ms stddev 0.374
progress: 1330.0 s, 39111.4 tps, lat 1.254 ms stddev 0.398
progress: 1340.0 s, 39448.1 tps, lat 1.243 ms stddev 0.305
progress: 1350.0 s, 13243.8 tps, lat 3.703 ms stddev 28.651
progress: 1360.0 s, 585.1 tps, lat 84.909 ms stddev 140.885
progress: 1370.0 s, 290.9 tps, lat 162.365 ms stddev 198.065
progress: 1380.0 s, 19298.5 tps, lat 2.753 ms stddev 33.827
progress: 1390.0 s, 39778.4 tps, lat 1.232 ms stddev 0.268
progress: 1400.0 s, 39582.1 tps, lat 1.238 ms stddev 0.269
progress: 1410.0 s, 39641.0 tps, lat 1.237 ms stddev 0.313
progress: 1420.0 s, 34083.8 tps, lat 1.442 ms stddev 0.933
progress: 1430.0 s, 17053.8 tps, lat 2.895 ms stddev 2.501
progress: 1440.0 s, 30782.6 tps, lat 1.598 ms stddev 5.398
progress: 1450.0 s, 36985.4 tps, lat 1.327 ms stddev 3.384
progress: 1460.0 s, 39051.7 tps, lat 1.256 ms stddev 0.294
progress: 1470.0 s, 39621.2 tps, lat 1.238 ms stddev 0.292
progress: 1480.0 s, 39271.3 tps, lat 1.249 ms stddev 0.394
progress: 1490.0 s, 39503.9 tps, lat 1.242 ms stddev 0.292
progress: 1500.0 s, 39760.1 tps, lat 1.233 ms stddev 0.284
progress: 1510.0 s, 39434.9 tps, lat 1.244 ms stddev 0.374
progress: 1520.0 s, 39587.5 tps, lat 1.238 ms stddev 0.294
progress: 1530.0 s, 39317.2 tps, lat 1.247 ms stddev 0.315
progress: 1540.0 s, 39395.3 tps, lat 1.245 ms stddev 0.362
progress: 1550.0 s, 39153.0 tps, lat 1.252 ms stddev 0.398
progress: 1560.0 s, 39654.7 tps, lat 1.236 ms stddev 0.296
progress: 1570.0 s, 39247.3 tps, lat 1.250 ms stddev 0.427
progress: 1580.0 s, 39486.2 tps, lat 1.242 ms stddev 0.370
progress: 1590.0 s, 39824.0 tps, lat 1.231 ms stddev 0.317
progress: 1600.0 s, 39617.6 tps, lat 1.238 ms stddev 0.371
progress: 1610.0 s, 39322.1 tps, lat 1.247 ms stddev 0.366
progress: 1620.0 s, 39577.2 tps, lat 1.239 ms stddev 0.321
progress: 1630.0 s, 39187.9 tps, lat 1.251 ms stddev 0.416
progress: 1640.0 s, 38819.3 tps, lat 1.263 ms stddev 0.435
progress: 1650.0 s, 39321.0 tps, lat 1.247 ms stddev 0.325
progress: 1660.0 s, 38812.2 tps, lat 1.264 ms stddev 0.391
progress: 1670.0 s, 38488.4 tps, lat 1.275 ms stddev 0.418
progress: 1680.0 s, 39062.2 tps, lat 1.255 ms stddev 0.329
progress: 1690.0 s, 38659.3 tps, lat 1.269 ms stddev 0.391
progress: 1700.0 s, 38768.5 tps, lat 1.265 ms stddev 0.391
progress: 1710.0 s, 39136.9 tps, lat 1.253 ms stddev 0.389
progress: 1720.0 s, 39059.8 tps, lat 1.256 ms stddev 0.390
progress: 1730.0 s, 38755.6 tps, lat 1.266 ms stddev 0.366
progress: 1740.0 s, 10897.4 tps, lat 4.504 ms stddev 30.516
progress: 1750.0 s, 232.0 tps, lat 217.113 ms stddev 165.393
progress: 1760.0 s, 655.0 tps, lat 76.258 ms stddev 92.935
progress: 1770.0 s, 14710.8 tps, lat 3.387 ms stddev 22.690
progress: 1780.0 s, 39373.7 tps, lat 1.245 ms stddev 0.287
progress: 1790.0 s, 39004.3 tps, lat 1.257 ms stddev 0.300
progress: 1800.0 s, 39165.3 tps, lat 1.252 ms stddev 0.301
progress: 1810.0 s, 39114.8 tps, lat 1.254 ms stddev 0.321
progress: 1820.0 s, 14962.6 tps, lat 3.305 ms stddev 12.098
progress: 1830.0 s, 18107.2 tps, lat 2.724 ms stddev 10.493
progress: 1840.0 s, 33705.5 tps, lat 1.457 ms stddev 3.243
progress: 1850.0 s, 37889.1 tps, lat 1.295 ms stddev 0.350
progress: 1860.0 s, 38617.8 tps, lat 1.270 ms stddev 0.334
progress: 1870.0 s, 39044.4 tps, lat 1.256 ms stddev 0.339
progress: 1880.0 s, 38882.6 tps, lat 1.261 ms stddev 0.335
progress: 1890.0 s, 39200.2 tps, lat 1.251 ms stddev 0.346
progress: 1900.0 s, 39124.4 tps, lat 1.254 ms stddev 0.349
progress: 1910.0 s, 38690.4 tps, lat 1.268 ms stddev 0.375
progress: 1920.0 s, 39452.9 tps, lat 1.243 ms stddev 0.336
progress: 1930.0 s, 39329.2 tps, lat 1.247 ms stddev 0.378
progress: 1940.0 s, 39281.4 tps, lat 1.248 ms stddev 0.335
progress: 1950.0 s, 39490.9 tps, lat 1.242 ms stddev 0.302
progress: 1960.0 s, 39201.5 tps, lat 1.251 ms stddev 0.403
progress: 1970.0 s, 38947.1 tps, lat 1.259 ms stddev 0.336
progress: 1980.0 s, 39537.5 tps, lat 1.240 ms stddev 0.287
progress: 1990.0 s, 38894.9 tps, lat 1.261 ms stddev 0.440
progress: 2000.0 s, 39439.9 tps, lat 1.243 ms stddev 0.310
progress: 2010.0 s, 39341.7 tps, lat 1.246 ms stddev 0.332
progress: 2020.0 s, 38973.1 tps, lat 1.258 ms stddev 0.444
progress: 2030.0 s, 39012.7 tps, lat 1.257 ms stddev 0.346
progress: 2040.0 s, 39651.1 tps, lat 1.237 ms stddev 0.297
progress: 2050.0 s, 38974.1 tps, lat 1.258 ms stddev 0.443
progress: 2060.0 s, 38950.9 tps, lat 1.259 ms stddev 0.405
progress: 2070.0 s, 39428.7 tps, lat 1.244 ms stddev 0.315
progress: 2080.0 s, 38861.4 tps, lat 1.262 ms stddev 0.426
progress: 2090.0 s, 38810.3 tps, lat 1.264 ms stddev 0.406
progress: 2100.0 s, 39360.6 tps, lat 1.246 ms stddev 0.317
progress: 2110.0 s, 38869.6 tps, lat 1.262 ms stddev 0.409
progress: 2120.0 s, 4194.6 tps, lat 11.723 ms stddev 53.921
progress: 2130.0 s, 444.9 tps, lat 112.667 ms stddev 97.187
progress: 2140.0 s, 540.9 tps, lat 90.376 ms stddev 100.796
progress: 2150.0 s, 5673.4 tps, lat 9.065 ms stddev 39.786
progress: 2160.0 s, 39359.9 tps, lat 1.246 ms stddev 0.301
progress: 2170.0 s, 39372.5 tps, lat 1.245 ms stddev 0.300
progress: 2180.0 s, 39385.3 tps, lat 1.245 ms stddev 0.307
progress: 2190.0 s, 33503.0 tps, lat 1.468 ms stddev 8.666
progress: 2200.0 s, 22894.5 tps, lat 2.155 ms stddev 8.470
progress: 2210.0 s, 18712.1 tps, lat 2.635 ms stddev 1.466
progress: 2220.0 s, 34893.1 tps, lat 1.408 ms stddev 1.509
progress: 2230.0 s, 37814.2 tps, lat 1.298 ms stddev 0.325
progress: 2240.0 s, 38544.7 tps, lat 1.273 ms stddev 0.318
progress: 2250.0 s, 38528.2 tps, lat 1.273 ms stddev 0.471
progress: 2260.0 s, 39191.0 tps, lat 1.251 ms stddev 0.300
progress: 2270.0 s, 38963.3 tps, lat 1.259 ms stddev 0.320
progress: 2280.0 s, 35086.7 tps, lat 1.400 ms stddev 6.872
progress: 2290.0 s, 39439.5 tps, lat 1.243 ms stddev 0.309
progress: 2300.0 s, 39121.8 tps, lat 1.253 ms stddev 0.308
progress: 2310.0 s, 38924.1 tps, lat 1.260 ms stddev 0.443
progress: 2320.0 s, 38827.8 tps, lat 1.263 ms stddev 0.418
progress: 2330.0 s, 39342.9 tps, lat 1.247 ms stddev 0.319
progress: 2340.0 s, 39186.2 tps, lat 1.252 ms stddev 0.340
progress: 2350.0 s, 39265.5 tps, lat 1.249 ms stddev 0.383
progress: 2360.0 s, 39152.5 tps, lat 1.253 ms stddev 0.331
progress: 2370.0 s, 39486.1 tps, lat 1.242 ms stddev 0.371
progress: 2380.0 s, 39300.7 tps, lat 1.248 ms stddev 0.346
progress: 2390.0 s, 38637.4 tps, lat 1.270 ms stddev 0.383
progress: 2400.0 s, 38280.8 tps, lat 1.282 ms stddev 1.976
progress: 2410.0 s, 39599.3 tps, lat 1.239 ms stddev 0.366
progress: 2420.0 s, 39313.8 tps, lat 1.247 ms stddev 0.331
progress: 2430.0 s, 39233.6 tps, lat 1.250 ms stddev 0.370
progress: 2440.0 s, 39061.0 tps, lat 1.255 ms stddev 0.427
progress: 2450.0 s, 39039.9 tps, lat 1.256 ms stddev 0.344
progress: 2460.0 s, 38876.9 tps, lat 1.262 ms stddev 0.388
progress: 2470.0 s, 39112.7 tps, lat 1.254 ms stddev 0.410
progress: 2480.0 s, 21556.6 tps, lat 2.267 ms stddev 12.529
progress: 2490.0 s, 389.6 tps, lat 128.758 ms stddev 99.847
progress: 2500.0 s, 569.2 tps, lat 85.854 ms stddev 95.188
progress: 2510.0 s, 521.8 tps, lat 98.401 ms stddev 89.594
progress: 2520.0 s, 8734.2 tps, lat 5.704 ms stddev 23.597
progress: 2530.0 s, 39257.1 tps, lat 1.249 ms stddev 0.293
progress: 2540.0 s, 39048.0 tps, lat 1.256 ms stddev 0.303
progress: 2550.0 s, 39123.1 tps, lat 1.253 ms stddev 0.313
progress: 2560.0 s, 39166.0 tps, lat 1.252 ms stddev 0.348
progress: 2570.0 s, 16480.1 tps, lat 3.001 ms stddev 2.507
progress: 2580.0 s, 16542.6 tps, lat 2.985 ms stddev 6.726
progress: 2590.0 s, 31653.3 tps, lat 1.554 ms stddev 4.642
progress: 2600.0 s, 37266.9 tps, lat 1.317 ms stddev 0.356
progress: 2610.0 s, 38374.4 tps, lat 1.279 ms stddev 0.340
progress: 2620.0 s, 38219.7 tps, lat 1.284 ms stddev 0.451
progress: 2630.0 s, 38298.6 tps, lat 1.281 ms stddev 0.347
progress: 2640.0 s, 38606.9 tps, lat 1.271 ms stddev 0.374
progress: 2650.0 s, 37482.2 tps, lat 1.309 ms stddev 2.575
progress: 2660.0 s, 38389.0 tps, lat 1.278 ms stddev 0.410
progress: 2670.0 s, 39034.2 tps, lat 1.256 ms stddev 0.343
progress: 2680.0 s, 38706.4 tps, lat 1.267 ms stddev 0.459
progress: 2690.0 s, 38407.2 tps, lat 1.277 ms stddev 0.421
progress: 2700.0 s, 38581.8 tps, lat 1.272 ms stddev 0.406
progress: 2710.0 s, 38559.7 tps, lat 1.272 ms stddev 0.597
progress: 2720.0 s, 33769.3 tps, lat 1.456 ms stddev 6.716
progress: 2730.0 s, 38932.1 tps, lat 1.260 ms stddev 0.354
progress: 2740.0 s, 38808.8 tps, lat 1.264 ms stddev 0.380
progress: 2750.0 s, 38286.2 tps, lat 1.282 ms stddev 0.391
progress: 2760.0 s, 32096.7 tps, lat 1.533 ms stddev 8.871
progress: 2770.0 s, 38386.4 tps, lat 1.278 ms stddev 0.382
progress: 2780.0 s, 38479.6 tps, lat 1.275 ms stddev 0.343
progress: 2790.0 s, 29706.5 tps, lat 1.658 ms stddev 8.183
progress: 2800.0 s, 37540.7 tps, lat 1.307 ms stddev 1.587
progress: 2810.0 s, 37891.5 tps, lat 1.295 ms stddev 0.429
progress: 2820.0 s, 35026.1 tps, lat 1.403 ms stddev 5.840
progress: 2830.0 s, 31898.6 tps, lat 1.543 ms stddev 5.794
progress: 2840.0 s, 27230.7 tps, lat 1.801 ms stddev 9.479
progress: 2850.0 s, 972.4 tps, lat 51.189 ms stddev 51.035
progress: 2860.0 s, 847.4 tps, lat 59.442 ms stddev 55.128
progress: 2870.0 s, 374.0 tps, lat 130.564 ms stddev 129.998
progress: 2880.0 s, 1405.2 tps, lat 35.561 ms stddev 56.733
progress: 2890.0 s, 36747.3 tps, lat 1.366 ms stddev 5.260
progress: 2900.0 s, 39483.9 tps, lat 1.242 ms stddev 0.303
progress: 2910.0 s, 39009.2 tps, lat 1.257 ms stddev 0.324
progress: 2920.0 s, 34161.9 tps, lat 1.439 ms stddev 5.775
progress: 2930.0 s, 25723.5 tps, lat 1.917 ms stddev 8.320
progress: 2940.0 s, 14061.8 tps, lat 3.461 ms stddev 7.945
progress: 2950.0 s, 18929.2 tps, lat 2.651 ms stddev 12.437
progress: 2960.0 s, 30552.6 tps, lat 1.610 ms stddev 4.867
progress: 2970.0 s, 37277.2 tps, lat 1.317 ms stddev 0.362
progress: 2980.0 s, 37735.1 tps, lat 1.301 ms stddev 0.418
progress: 2990.0 s, 27736.7 tps, lat 1.777 ms stddev 7.644
progress: 3000.0 s, 31560.4 tps, lat 1.560 ms stddev 5.909
progress: 3010.0 s, 38821.3 tps, lat 1.264 ms stddev 0.350
progress: 3020.0 s, 28010.1 tps, lat 1.755 ms stddev 8.141
progress: 3030.0 s, 32168.4 tps, lat 1.535 ms stddev 3.881
progress: 3040.0 s, 39109.9 tps, lat 1.254 ms stddev 0.419
progress: 3050.0 s, 36282.9 tps, lat 1.353 ms stddev 3.679
progress: 3060.0 s, 30253.8 tps, lat 1.628 ms stddev 4.372
progress: 3070.0 s, 38828.2 tps, lat 1.263 ms stddev 0.498
progress: 3080.0 s, 38818.8 tps, lat 1.263 ms stddev 0.364
progress: 3090.0 s, 31302.8 tps, lat 1.572 ms stddev 6.555
progress: 3100.0 s, 38043.7 tps, lat 1.290 ms stddev 0.550
progress: 3110.0 s, 38445.3 tps, lat 1.276 ms stddev 0.393
progress: 3120.0 s, 29126.6 tps, lat 1.673 ms stddev 6.093
progress: 3130.0 s, 33623.2 tps, lat 1.479 ms stddev 5.157
progress: 3140.0 s, 38432.5 tps, lat 1.277 ms stddev 0.602
progress: 3150.0 s, 34966.2 tps, lat 1.405 ms stddev 5.073
progress: 3160.0 s, 28603.4 tps, lat 1.723 ms stddev 5.388
progress: 3170.0 s, 30447.1 tps, lat 1.618 ms stddev 4.389
progress: 3180.0 s, 37478.6 tps, lat 1.310 ms stddev 2.096
progress: 3190.0 s, 32747.2 tps, lat 1.483 ms stddev 4.320
progress: 3200.0 s, 20447.7 tps, lat 2.450 ms stddev 8.978
progress: 3210.0 s, 38485.4 tps, lat 1.274 ms stddev 0.536
progress: 3220.0 s, 9159.0 tps, lat 5.410 ms stddev 14.600
progress: 3230.0 s, 1540.0 tps, lat 32.142 ms stddev 32.256
progress: 3240.0 s, 1238.2 tps, lat 40.582 ms stddev 51.709
progress: 3250.0 s, 866.3 tps, lat 56.909 ms stddev 38.058
progress: 3260.0 s, 31595.3 tps, lat 1.586 ms stddev 6.163
progress: 3270.0 s, 39013.7 tps, lat 1.257 ms stddev 0.357
progress: 3280.0 s, 38943.4 tps, lat 1.259 ms stddev 0.354
progress: 3290.0 s, 24960.1 tps, lat 1.978 ms stddev 8.965
progress: 3300.0 s, 36532.9 tps, lat 1.344 ms stddev 0.502
progress: 3310.0 s, 10519.7 tps, lat 4.710 ms stddev 13.908
progress: 3320.0 s, 18674.5 tps, lat 2.652 ms stddev 8.921
progress: 3330.0 s, 8180.2 tps, lat 6.078 ms stddev 21.126
progress: 3340.0 s, 30828.1 tps, lat 1.592 ms stddev 3.986
progress: 3350.0 s, 34457.4 tps, lat 1.430 ms stddev 3.646
progress: 3360.0 s, 36634.1 tps, lat 1.340 ms stddev 1.291
progress: 3370.0 s, 19526.6 tps, lat 2.535 ms stddev 9.727
progress: 3380.0 s, 28241.8 tps, lat 1.745 ms stddev 8.078
progress: 3390.0 s, 36976.8 tps, lat 1.327 ms stddev 1.477
progress: 3400.0 s, 32914.6 tps, lat 1.489 ms stddev 3.684
progress: 3410.0 s, 18205.9 tps, lat 2.730 ms stddev 12.176
progress: 3420.0 s, 32621.0 tps, lat 1.508 ms stddev 5.825
progress: 3430.0 s, 37470.4 tps, lat 1.310 ms stddev 0.915
progress: 3440.0 s, 28196.2 tps, lat 1.747 ms stddev 4.308
progress: 3450.0 s, 20612.2 tps, lat 2.401 ms stddev 7.387
progress: 3460.0 s, 35161.2 tps, lat 1.397 ms stddev 3.149
progress: 3470.0 s, 38826.2 tps, lat 1.263 ms stddev 0.306
progress: 3480.0 s, 5032.2 tps, lat 9.860 ms stddev 22.324
progress: 3490.0 s, 36654.2 tps, lat 1.346 ms stddev 2.508
progress: 3500.0 s, 35412.1 tps, lat 1.387 ms stddev 2.119
progress: 3510.0 s, 25508.3 tps, lat 1.934 ms stddev 5.859
progress: 3520.0 s, 15851.2 tps, lat 3.131 ms stddev 11.555
progress: 3530.0 s, 34348.5 tps, lat 1.431 ms stddev 3.351
progress: 3540.0 s, 38925.5 tps, lat 1.260 ms stddev 0.321
progress: 3550.0 s, 9726.5 tps, lat 5.104 ms stddev 13.210
progress: 3560.0 s, 29529.4 tps, lat 1.669 ms stddev 6.700
progress: 3570.0 s, 38915.4 tps, lat 1.260 ms stddev 0.325
progress: 3580.0 s, 29758.7 tps, lat 1.653 ms stddev 4.234
progress: 3590.0 s, 20493.2 tps, lat 2.415 ms stddev 5.474
progress: 3600.0 s, 34649.3 tps, lat 1.419 ms stddev 2.428
transaction type: pgbench_write_orioledb.sql
scaling factor: 1
query mode: simple
number of clients: 50
number of threads: 5
duration: 3600 s
number of transactions actually processed: 117010324
latency average = 1.513 ms
latency stddev = 6.598 ms
tps = 32502.855901 (including connections establishing)
tps = 32502.904347 (excluding connections establishing)
statement latencies in milliseconds:
         0.000  \set region_id 0
         0.005  \set ns_id random_zipfian(1, 10, 1.1)
         0.002  \set emitter random_zipfian(1000, 3000, 1.1)
         0.001  \set root_player_id random(1, 100000*:scale)
         0.003  \set currency_id random_zipfian(1, 50, 1.1)
         0.000  \set amount random(1, 10000)
         0.097  BEGIN;
         0.235  INSERT INTO trx_pgbench_0
         0.208  INSERT INTO op_pgbench_0
         0.168  INSERT INTO balance_version_pgbench_0
         0.222  INSERT INTO balance_pgbench_0
         0.573  END;